---
type: ElementRecord
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# ElementRecord

`Autodesk.Revit.DB.ElementRecord` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetBoundingBox | 2011 | `public Outline GetBoundingBox ()` |
| Method | GetCategoryId | 2011 | `public ElementId GetCategoryId ()` |
| Method | GetDesignOptionId | 2011 | `public ElementId GetDesignOptionId ()` |
| Method | GetId | 2011 | `public ElementId GetId ()` |
| Method | GetOwnerViewId | 2011 | `public ElementId GetOwnerViewId ()` |
| Method | HasBoundingBox | 2011 | `public bool HasBoundingBox ()` |
| Method | IsAnElementType | 2011 | `public bool IsAnElementType ()` |
| Method | IsCurveDriven | 2011 | `public bool IsCurveDriven ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | WorksetId | 2011 | `public WorksetId WorksetId { get ; }` |